RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include_pvt/cyhal_hw_types.h
/** Callbacks for Sleep and Deepsleep APIs */
#define cyhal_system_callback_t cy_stc_syspm_callback_t

/** @brief Event callback data object */
typedef struct {
    cy_israddress                       callback;
    void*                               callback_arg;
} cyhal_event_callback_data_t;

/**
 * @brief Shared data between timer/counter and PWM
 *
 * Application code should not rely on the specific content of this struct.
 * They are considered an implementation detail which is subject to change
 * between platforms and/or HAL releases.
 */
typedef struct {
#ifdef CY_IP_MXTCPWM
    bool                                owned_by_configurator;
    TCPWM_Type*                         base;
    cyhal_resource_inst_t               resource;
    cyhal_clock_t                       clock;
    bool                                dedicated_clock;
    uint32_t                            clock_hz;
    cyhal_event_callback_data_t         callback_data;
#if defined(CY_IP_MXPERI_TR) || defined(CY_IP_MXSPERI)
    cyhal_source_t                      inputs[5];
#endif
#else
    void *empty;
#endif
} cyhal_tcpwm_t;

/* This is presented out of order because many other structs depend on it */
/**
  * @brief DMA object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_M7CPUSS_DMAC) || defined(CY_IP_M4CPUSS_DMA) || defined(CY_IP_M7CPUSS_DMA) || defined(CY_IP_MXAHBDMAC) || defined(CY_IP_MXDW)
    cyhal_resource_inst_t               resource;
    union
    {
#if defined(CY_IP_M4CPUSS_DMA) || defined(CY_IP_M7CPUSS_DMA) || defined(CY_IP_MXDW)
        cy_stc_dma_channel_config_t     dw;
#endif
#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_M7CPUSS_DMAC) || defined(CY_IP_MXAHBDMAC)
        cy_stc_dmac_channel_config_t    dmac;
#endif
    } channel_config;
    union
    {
#if defined(CY_IP_M4CPUSS_DMA) || defined(CY_IP_M7CPUSS_DMA) || defined(CY_IP_MXDW)
        cy_stc_dma_descriptor_config_t  dw;
#endif
#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_M7CPUSS_DMAC) || defined(CY_IP_MXAHBDMAC)
        cy_stc_dmac_descriptor_config_t dmac;
#endif
    } descriptor_config;
    union
    {
#if defined(CY_IP_M4CPUSS_DMA) || defined(CY_IP_M7CPUSS_DMA) || defined(CY_IP_MXDW)
        cy_stc_dma_descriptor_t         dw;
#endif
#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_M7CPUSS_DMAC) || defined(CY_IP_MXAHBDMAC)
        cy_stc_dmac_descriptor_t        dmac;
#endif
    } descriptor;
    uint16_t                            expected_bursts;
    uint32_t/* cyhal_dma_direction_t */ direction;
    uint32_t                            irq_cause;
    cyhal_event_callback_data_t         callback_data;
    cyhal_source_t                      source;
    bool                                owned_by_configurator;
#else
    void *empty;
#endif
} cyhal_dma_t;

/**
  * @brief DMA configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct
{
#if CYHAL_DRIVER_AVAILABLE_DMA
    const cyhal_resource_inst_t*                    resource;
    struct
    {
        union
        {
#if defined(CY_IP_M4CPUSS_DMA) || defined(CY_IP_M7CPUSS_DMA) || defined(CY_IP_MXDW)
            cy_stc_dma_channel_config_t const*      dw_channel_config;
#endif
#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_M7CPUSS_DMAC) || defined(CY_IP_MXAHBDMAC)
            cy_stc_dmac_channel_config_t const*     dmac_channel_config;
#endif
        };
        union
        {
#if defined(CY_IP_M4CPUSS_DMA) || defined(CY_IP_M7CPUSS_DMA) || defined(CY_IP_MXDW)
            cy_stc_dma_descriptor_config_t const*   dw_descriptor_config;
#endif
#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_M7CPUSS_DMAC) || defined(CY_IP_MXAHBDMAC)
            cy_stc_dmac_descriptor_config_t const*  dmac_descriptor_config;
#endif
        };
    };
#else
    void *empty;
#endif /* CYHAL_DRIVER_AVAILABLE_DMA */
} cyhal_dma_configurator_t;

struct _cyhal_audioss_s;

/**
  * @brief Interface to abstract away the driver-specific differences between TDM and I2S
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct
{
#if defined(CY_IP_MXAUDIOSS)
    /** Convert a PDL-level interrupt cause to a HAL-level event */
    uint32_t (*convert_interrupt_cause)(uint32_t pdl_event);
    /** Convert a HAL-level event to a PDL-level interrupt cause */
    uint32_t (*convert_to_pdl)(uint32_t hal_event);
#elif defined(CY_IP_MXTDM)
    /** Convert a PDL-level interrupt cause to a HAL-level event */
    uint32_t (*convert_interrupt_cause)(uint32_t pdl_event, bool is_tx);
    /** Convert a HAL-level event to a PDL-level interrupt cause */
    uint32_t (*convert_to_pdl)(uint32_t hal_event, bool is_tx);
#endif
    /** Invoke the user callback with the specified HAL event.
     * Only called after the user callback has been verified to not be null. */
    void     (*invoke_user_callback)(struct _cyhal_audioss_s* obj, uint32_t hal_event);
    /** HAL event mask that represents the empty state */
    uint32_t event_mask_empty;
    /** HAL event mask that represents the half empty state */
    uint32_t event_mask_half_empty;
    /** HAL event mask that represents the full state */
    uint32_t event_mask_full;
    /** HAL event mask that represents the half full state */
    uint32_t event_mask_half_full;
    /** HAL event mask that represents async rx complete */
    uint32_t event_rx_complete;
    /** HAL event mask that represents async tx complete */
    uint32_t event_tx_complete;
    /** Error code for invalid pin */
    cy_rslt_t err_invalid_pin;
    /** Error code for invalid argument */
    cy_rslt_t err_invalid_arg;
    /** Error code for invalid clock frequency */
    cy_rslt_t err_clock;
    /** Error code for configuration not supported */
    cy_rslt_t err_not_supported;
} _cyhal_audioss_interface_t;

/**
  * @brief Shared data between i2s and tdm
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct _cyhal_audioss_s { /* Explicit name to enable forward declaration */
#if defined(CY_IP_MXAUDIOSS) || defined(CY_IP_MXTDM)
    bool                            owned_by_configurator;
#if defined(CY_IP_MXAUDIOSS)
    I2S_Type                        *base;
#elif defined(CY_IP_MXTDM)
    /* None of the PDL APIs actually want a bare TDM_Type */
    TDM_STRUCT_Type                 *base;
#endif
    cyhal_resource_inst_t           resource;
    cyhal_gpio_t                    pin_tx_sck;
    cyhal_gpio_t                    pin_tx_ws;
    cyhal_gpio_t                    pin_tx_sdo;
    cyhal_gpio_t                    pin_rx_sck;
    cyhal_gpio_t                    pin_rx_mclk;
    cyhal_gpio_t                    pin_rx_ws;
    cyhal_gpio_t                    pin_rx_sdi;
    cyhal_gpio_t                    pin_tx_mclk;
    uint8_t                         user_fifo_level_rx;
    uint32_t                        mclk_hz_rx;
    uint8_t                         channel_length_rx;
    uint8_t                         word_length_rx;
    uint32_t                        mclk_hz_tx;
    uint8_t                         channel_length_tx;
    uint8_t                         word_length_tx;
    cyhal_clock_t                   clock;
    bool                            is_clock_owned;
    uint16_t                        user_enabled_events;
    cyhal_event_callback_data_t     callback_data;
    cyhal_async_mode_t              async_mode;
    uint8_t                         async_dma_priority;
    cyhal_dma_t                     tx_dma;
    cyhal_dma_t                     rx_dma;
    // Note: When the async DMA mode is in use, these variables will always reflect the state
    // that the transfer will be in after the in-progress DMA transfer, if any, is complete
    volatile const void             *async_tx_buff;
    volatile size_t                 async_tx_length;
    volatile void                   *async_rx_buff;
    volatile size_t                 async_rx_length;
    volatile bool                   pm_transition_ready;
    cyhal_syspm_callback_data_t     pm_callback;
    const _cyhal_audioss_interface_t *interface;
#else
    void *empty;
#endif
} _cyhal_audioss_t;

/**
  * @brief Shared I2S/TDM configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct
{
#if CYHAL_DRIVER_AVAILABLE_TDM || CYHAL_DRIVER_AVAILABLE_I2S
    const cyhal_resource_inst_t*            resource;
#if defined(CY_IP_MXAUDIOSS)
    const cy_stc_i2s_config_t*              config;
#elif defined(CY_IP_MXTDM)
    const cy_stc_tdm_config_t*              config;
#endif
    const cyhal_clock_t *                   clock;
    uint32_t                                mclk_hz_rx; /* Must be 0 is mclk is not in use for this direction */
    uint32_t                                mclk_hz_tx; /* Must be 0 is mclk is not in use for this direction */
#else
    void *empty;
#endif /* CYHAL_DRIVER_AVAILABLE_TDM || CYHAL_DRIVER_AVAILABLE_I2S */
} _cyhal_audioss_configurator_t;

