RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include_pvt/cyhal_hw_types.h
struct _cyhal_adc_channel_s;

/**
  * @brief ADC object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXS40PASS_SAR) || defined(CY_IP_MXS40ADCMIC_INSTANCES)
    bool                                owned_by_configurator;
#if defined(CY_IP_MXS40PASS_SAR)
    SAR_Type*                           base;
    struct _cyhal_adc_channel_s*        channel_config[CY_SAR_MAX_NUM_CHANNELS];
#elif defined(CY_IP_MXS40ADCMIC_INSTANCES)
    MXS40ADCMIC_Type*                   base;
    /* When doing a full scan, which channel are we on */
    uint8_t                             current_channel_index;
    /* We implement multi-channel sequencing in firmware; there's no fixed channel count specified
     * in hardware. So size the array based on the number of input pins that are connected */
    struct _cyhal_adc_channel_s*        channel_config[sizeof(cyhal_pin_map_adcmic_gpio_adc_in) / sizeof(cyhal_pin_map_adcmic_gpio_adc_in[0])];
#endif
    cyhal_resource_inst_t               resource;
    cyhal_clock_t                       clock;
    bool                                dedicated_clock;
    /* Has at least one conversion completed since the last configuration change */
    volatile bool                       conversion_complete;
    bool                                stop_after_scan;
    uint8_t                             user_enabled_events;
    cyhal_event_callback_data_t         callback_data;
    /* Always updated to contain the location where the next result should be stored */
    int32_t                             *async_buff_next;
    bool                                async_transfer_in_uv; /* Default is counts */
    /* Only decremented after all elements from a scan have been copied into async_buff */
    size_t                              async_scans_remaining;
#if defined(CY_IP_MXS40PASS_SAR)
    /* ADCMIC is always continuously scanning and only supports SW-based async transfers */
    bool                                continuous_scanning;
    cyhal_async_mode_t                  async_mode;
    cyhal_dma_t                         dma;
    cyhal_source_t                      source; /* SAR-only; ADCMIC has no useful triggers in DC mode */
    int32_t                             *async_buff_orig;
#endif
#else
    void *empty;
#endif /* defined(CY_IP_MXS40PASS_SAR) || defined(CY_IP_MXS40ADCMIC_INSTANCES) */
} cyhal_adc_t;

/**
  * @brief ADC configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct
{
#if CYHAL_DRIVER_AVAILABLE_ADC
    const cyhal_resource_inst_t*        resource;
#if defined(CY_IP_MXS40PASS_SAR)
    cy_stc_sar_config_t const*          config;
#elif defined(CY_IP_MXS40ADCMIC_INSTANCES)
    cy_stc_adcmic_config_t const*       config;
#endif
    const cyhal_clock_t *               clock;
    uint8_t                             num_channels;
    const uint32_t*                     achieved_acquisition_time; /* length num_channels */
    /* Pins are deliberately omitted from this struct. The configurator supports routing
     * from arbitrary sources that aren't necessarily pins. The HAL only needs to know what
     * the pins are for the purposes of reservation, freeing, and routing - all of which the
     * configurators take care of in this flow */
#else
     void *empty;
#endif
} cyhal_adc_configurator_t;

/**
  * @brief ADC channel object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct _cyhal_adc_channel_s { /* Struct given an explicit name to make the forward declaration above work */
#if defined(CY_IP_MXS40PASS_SAR) || defined(CY_IP_MXS40ADCMIC_INSTANCES)
    cyhal_adc_t*                        adc;
    cyhal_gpio_t                        vplus;
    uint8_t                             channel_idx;
#if defined(CY_IP_MXS40ADCMIC_INSTANCES)
    cy_en_adcmic_dc_channel_t           channel_sel;
    bool                                enabled;
#elif defined(CY_IP_MXS40PASS_SAR)
    /* ADCMIC only supports single-ended channels at a fixed sample rate */
    cyhal_gpio_t                        vminus;
    uint32_t                            minimum_acquisition_ns;
#endif
#else
    void *empty;
#endif
} cyhal_adc_channel_t;

/** @brief Comparator object */
typedef struct {
#if defined(CY_IP_MXLPCOMP_INSTANCES) || defined(CY_IP_MXS40PASS_CTB_INSTANCES)
    bool                                owned_by_configurator;
    cyhal_resource_inst_t               resource;
    union
    {
#if defined(CY_IP_MXS40PASS_CTB_INSTANCES)
        CTBM_Type                       *base_ctb;
#endif
#if defined(CY_IP_MXLPCOMP_INSTANCES)
        LPCOMP_Type                     *base_lpcomp;
#endif
    };
    cyhal_gpio_t                        pin_vin_p;
    cyhal_gpio_t                        pin_vin_m;
    cyhal_gpio_t                        pin_out;
    cyhal_event_callback_data_t         callback_data;
    uint32_t                            irq_cause;
#else
    void *empty;
#endif
} cyhal_comp_t;

/**
  * @brief Comp configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct
{
#if CYHAL_DRIVER_AVAILABLE_COMP
    const cyhal_resource_inst_t*        resource;
    union
    {
    #if _CYHAL_DRIVER_AVAILABLE_COMP_LP
        const cy_stc_lpcomp_config_t *lpcomp;
    #endif
    #if _CYHAL_DRIVER_AVAILABLE_COMP_CTB
        const cy_stc_ctb_opamp_config_t *opamp;
    #endif
    };
    /* No GPIOs specified. The configurator could have routed from a non-preferred
     * GPIO, or from another non-GPIO on-chip source. */
#else
    void *empty;
#endif
} cyhal_comp_configurator_t;

/**
  * @brief CRC object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXCRYPTO_INSTANCES) || defined(CPUSS_CRYPTO_PRESENT)
    CRYPTO_Type*                        base;
    cyhal_resource_inst_t               resource;
    uint32_t                            crc_width;
#else
    void *empty;
#endif
} cyhal_crc_t;

/**
  * @brief DAC object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXS40PASS_CTDAC
    bool                                owned_by_configurator;
    CTDAC_Type*                         base_dac;
    CTBM_Type*                          base_opamp;
    cyhal_resource_inst_t               resource_dac;
    cyhal_resource_inst_t               resource_opamp;
    cyhal_resource_inst_t               resource_aref_opamp;
    cyhal_gpio_t                        pin;
#else
    void *empty;
#endif
} cyhal_dac_t;

/**
  * @brief DAC configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct
{
#if CYHAL_DRIVER_AVAILABLE_DAC
    const cyhal_resource_inst_t*        resource;
    const cy_stc_ctdac_config_t*        config;
#else
    void *empty;
#endif /* CYHAL_DRIVER_AVAILABLE_DAC */
} cyhal_dac_configurator_t;

/**
  * @brief OPAMP object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXS40PASS_CTB_INSTANCES)
    bool                                owned_by_configurator;
    CTBM_Type*                          base;
    cyhal_resource_inst_t               resource;
    cyhal_gpio_t                        pin_vin_p;
    cyhal_gpio_t                        pin_vin_m;
    cyhal_gpio_t                        pin_vout;
    bool                                is_init_success;
#else
    void *empty;
#endif
} cyhal_opamp_t;

/**
  * @brief Opamp configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct
{
#if CYHAL_DRIVER_AVAILABLE_OPAMP
    const cyhal_resource_inst_t*        resource;
    const cy_stc_ctb_opamp_config_t*    config;
    /* No GPIOs specified. The configurator could have routed from a non-preferred
     * GPIO, or from another non-GPIO on-chip source. */
#else
    void *empty;
#endif
} cyhal_opamp_configurator_t;

/**
  * @brief Flash object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
    void *empty;
} cyhal_flash_t;

/**
  * @brief I2C object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXSCB
    CySCB_Type*                         base;
    cyhal_resource_inst_t               resource;
    cyhal_gpio_t                        pin_sda;
    cyhal_gpio_t                        pin_scl;
    cyhal_clock_t                       clock;
    bool                                is_clock_owned;
    cy_stc_scb_i2c_context_t            context;
    cy_stc_scb_i2c_master_xfer_config_t rx_config;
    cy_stc_scb_i2c_master_xfer_config_t tx_config;
    uint32_t                            irq_cause;
    uint16_t                            pending;
    cyhal_event_callback_data_t         callback_data;
    bool                                dc_configured;
#else
    void *empty;
#endif
} cyhal_i2c_t;

/**
  * @brief I2C configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXSCB)
    const cyhal_resource_inst_t*            resource;
    const cy_stc_scb_i2c_config_t*          config;
    const cyhal_clock_t*                    clock;
#else
    void *empty;
#endif /* defined(CY_IP_MXSCB) */
} cyhal_i2c_configurator_t;

/**
  * @brief EZI2C object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXSCB
    CySCB_Type*                         base;
    cyhal_resource_inst_t               resource;
    cyhal_gpio_t                        pin_sda;
    cyhal_gpio_t                        pin_scl;
    cyhal_clock_t                       clock;
    bool                                is_clock_owned;
    cy_stc_scb_ezi2c_context_t          context;
    uint32_t                            irq_cause;
    cyhal_event_callback_data_t         callback_data;
    bool                                two_addresses;
    bool                                dc_configured;
#else
    void *empty;
#endif
} cyhal_ezi2c_t;

/**
  * @brief EZI2C configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXSCB)
    const cyhal_resource_inst_t*            resource;
    const cy_stc_scb_ezi2c_config_t*        config;
    const cyhal_clock_t*                    clock;
#else
    void *empty;
#endif /* defined(CY_IP_MXSCB) */
} cyhal_ezi2c_configurator_t;

/**
  * @brief I2S object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef _cyhal_audioss_t cyhal_i2s_t;

/**
  * @brief I2S configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef _cyhal_audioss_configurator_t cyhal_i2s_configurator_t;

/**
  * @brief KeyScan object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if defined (CY_IP_MXKEYSCAN)
    MXKEYSCAN_Type*                     base;
    cyhal_resource_inst_t               resource;
    cyhal_gpio_t                        rows[MXKEYSCAN_NUM_ROWS_IN];
    cyhal_gpio_t                        columns[MXKEYSCAN_NUM_COLS_OUT];
    cyhal_clock_t                       clock;
    bool                                is_clock_owned;
    cy_stc_keyscan_context_t            context;
    uint32_t                            irq_cause;
    cyhal_event_callback_data_t         callback_data;
    bool                                dc_configured;
#else
    void *empty;
#endif
} cyhal_keyscan_t;

/**
  * @brief KeyScan configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct {
#if defined (CY_IP_MXKEYSCAN)
    const cyhal_resource_inst_t*            resource;
    /* keyscan PDL config is not const here because the config argument to Cy_Keyscan_Init is not const */
    cy_stc_ks_config_t*                     config;
    const cyhal_clock_t*                    clock;
#else
    void *empty;
#endif /* defined (CY_IP_MXKEYSCAN) */
} cyhal_keyscan_configurator_t;

/**
  * @brief LPTIMER object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    MCWDT_Type                          *base;
    cy_en_mcwdtctr_t                    counter;
    volatile uint32_t                   offset;
    volatile uint32_t                   final_time;
#else
    MCWDT_STRUCT_Type                   *base;
#endif
    cyhal_resource_inst_t               resource;
    cyhal_event_callback_data_t         callback_data;
    bool                                clear_int_mask;
    bool                                isr_call_user_cb;
} cyhal_lptimer_t;

/**
  * @brief PDM-PCM object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if !defined(COMPONENT_CAT1C)
#if defined(CY_IP_MXAUDIOSS_INSTANCES) || defined(CY_IP_MXTDM_INSTANCES)
    bool                                owned_by_configurator;
    PDM_Type                            *base;
    cyhal_resource_inst_t               resource;
    cyhal_gpio_t                        pin_data;
    cyhal_gpio_t                        pin_clk;
    cyhal_clock_t                       clock;
    bool                                is_clock_owned;
    /* Number of entries in the fifo when the trigger fires - i.e. one greater than the value in the register */
    uint8_t                             user_trigger_level;
    /** User requested irq, see cyhal_pdm_pcm_event_t */
    uint32_t                            irq_cause;
    cyhal_event_callback_data_t         callback_data;
    uint8_t                             word_size;
    cyhal_dma_t                         dma;
#if defined(CY_IP_MXPDM)
    cyhal_dma_t                         dma_paired;
#endif
    volatile bool                       stabilized;
    volatile bool                       pm_transition_ready;
    cyhal_syspm_callback_data_t         pm_callback;
    void                                *async_buffer;
    size_t                              async_read_remaining;
#else
    void *empty;
#endif
#else
    void *empty;
#endif
} cyhal_pdm_pcm_t;

/**
  * @brief PDM-PCM configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct {
#if !defined(COMPONENT_CAT1C)
#if defined(CY_IP_MXAUDIOSS_INSTANCES) || defined(CY_IP_MXTDM_INSTANCES)
    const cyhal_resource_inst_t*            resource;
#if defined(CY_IP_MXAUDIOSS_INSTANCES)
    const cy_stc_pdm_pcm_config_t*          config;
#elif defined(CY_IP_MXTDM_INSTANCES)
    const cy_stc_pdm_pcm_config_v2_t*       config;
    const cy_stc_pdm_pcm_channel_config_t*  chan_config;
#endif
    const cyhal_clock_t*                    clock;
#else
    void *empty;
#endif /* defined(CY_IP_MXSCB) */
#else
    void *empty;
#endif
} cyhal_pdm_pcm_configurator_t;

/**
  * @brief PWM object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXTCPWM
    cyhal_tcpwm_t                       tcpwm;
    cyhal_gpio_t                        pin;
    cyhal_gpio_t                        pin_compl;
    bool                                dead_time_set;
#else
    void *empty;
#endif
} cyhal_pwm_t;

/**
  * @brief PWM configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct
{
#if CYHAL_DRIVER_AVAILABLE_PWM
    const cyhal_resource_inst_t*        resource;
    cy_stc_tcpwm_pwm_config_t const*    config;
    const cyhal_clock_t *               clock;
#else
    void *empty;
#endif /* CYHAL_DRIVER_AVAILABLE_PWM */
} cyhal_pwm_configurator_t;

/**
  * @brief QSPI object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXSMIF
    SMIF_Type*                          base;
    cyhal_resource_inst_t               resource;
    cyhal_gpio_t                        pin_sclk;
    en_hsiom_sel_t                      saved_sclk_hsiom;
    cyhal_gpio_t                        pin_io[8];
    en_hsiom_sel_t                      saved_io_hsiom[8];
    cyhal_gpio_t                        pin_ssel[SMIF_CHIP_TOP_SPI_SEL_NR];
    en_hsiom_sel_t                      saved_ssel_hsiom[SMIF_CHIP_TOP_SPI_SEL_NR];
    /* Active slave select */
    cy_en_smif_slave_select_t           slave_select;
    cyhal_clock_t                       clock;
    bool                                is_clock_owned;
    uint8_t                             mode;
    cy_stc_smif_context_t               context;
    uint32_t                            irq_cause;
    cyhal_event_callback_data_t         callback_data;
    cyhal_syspm_callback_data_t         pm_callback;
    bool                                pm_transition_pending;
    bool                                dc_configured;
#else
    void *empty;
#endif /* ifdef CY_IP_MXSMIF */
} cyhal_qspi_t;

/**
  * @brief QSPI configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXSMIF
    const cyhal_resource_inst_t*            resource;
    const cy_stc_smif_config_t*             config;
    cyhal_clock_t*                          clock;
    struct
    {
        cyhal_gpio_t                        sclk;
        cyhal_gpio_t                        ssel[4];
        cyhal_gpio_t                        io[8];
    } gpios;
    /* Bit representation of currently not supported interrupts:
        Bit 5 : Memory Mode Alignment Error
        Bit 4 : RX Data FIFO Underflow
        Bit 3 : TX Command FIFO Overflow
        Bit 2 : TX Data FIFO Overflow
        Bit 1 : RX FIFO Level Trigger
        Bit 0 : TX FIFO Level Trigger
    */
    uint8_t                                 irqs;
    /* Bit representation of DMA triggers activation indicators:
        Bit 1 : RX Trigger Output activated in configurator
        Bit 0 : TX Trigger Output activated in configurator
    */
    uint8_t                                 dmas;
#else
    void *empty;
#endif /* defined(CY_IP_MXSMIF) */
} cyhal_qspi_configurator_t;

/**
  * @brief Quadrature Decoder object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXTCPWM
    cyhal_tcpwm_t                       tcpwm;
    cyhal_gpio_t                        phi_a;
    cyhal_gpio_t                        phi_b;
    cyhal_gpio_t                        index;
    uint32_t                            last_counter_value;
#else
    void *empty;
#endif
} cyhal_quaddec_t;

/**
  * @brief Quadrature Decoder configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct
{
#if CYHAL_DRIVER_AVAILABLE_QUADDEC
    const cyhal_resource_inst_t*            resource;
    const cy_stc_tcpwm_quaddec_config_t*    config;
    const cyhal_clock_t *                   clock;
#else
    void *empty;
#endif /* CYHAL_DRIVER_AVAILABLE_QUADDEC */
} cyhal_quaddec_configurator_t;

/**
  * @brief RNG object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXCRYPTO_INSTANCES) || defined(CPUSS_CRYPTO_PRESENT)
    CRYPTO_Type*                        base;
    cyhal_resource_inst_t               resource;
#else
    void *empty;
#endif
} cyhal_trng_t;

