RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include_pvt/cyhal_hw_types.h
/**
  * @brief RTC object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXS40SRSS) || defined(CY_IP_MXS40SSRSS)
    cy_stc_rtc_dst_t                    dst;
#else
    void *empty;
#endif
} cyhal_rtc_t;

/**
  * @brief RTC configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct
{
#if CYHAL_DRIVER_AVAILABLE_RTC
    const cyhal_resource_inst_t*        resource;
    cy_stc_rtc_config_t const*          config;
    cy_stc_rtc_dst_t const*             dst_config;
#else
    void *empty;
#endif /* CYHAL_DRIVER_AVAILABLE_RTC */
} cyhal_rtc_configurator_t;

#if defined(CY_IP_MXSDHC)

/**
 * Data transfer status on SDHC/SDIO
 */
typedef enum
{
    /** No data transfer in progress */
    _CYHAL_SDXX_NOT_RUNNING = 0x0,
    /** Waiting for a command to complete */
    _CYHAL_SDXX_WAIT_CMD_COMPLETE = 0x1,
    /** Waiting for a transfer to complete */
    _CYHAL_SDXX_WAIT_XFER_COMPLETE = 0x2,
    /** Waiting for completion of both a command and a transfer */
    _CYHAL_SDXX_WAIT_BOTH = _CYHAL_SDXX_WAIT_CMD_COMPLETE | _CYHAL_SDXX_WAIT_XFER_COMPLETE
} _cyhal_sdxx_data_transfer_status_t;

/**
 * Contains common members between SDHC and SDIO
 */
typedef struct {
    bool                                is_sdio;
    void*                               obj;

    SDHC_Type*                          base;
    cyhal_resource_inst_t               resource;
    cy_stc_sd_host_context_t            context;
    cyhal_clock_t                       clock;

    bool                                emmc;
    cy_en_sd_host_dma_type_t            dma_type;
    uint32_t                            adma_descriptor_tbl[2];
    _cyhal_sdxx_data_transfer_status_t  data_transfer_status;

    cyhal_gpio_t                        pin_clk;
    cyhal_gpio_t                        pin_cmd;
    cyhal_gpio_t                        pin_io_vol_sel;
    bool                                low_voltage_io_set;

    uint32_t                            irq_cause;
    cyhal_event_callback_data_t         callback_data;

    bool                                pm_transition_pending;
    cyhal_syspm_callback_data_t         pm_callback_data;
    /* whether the block is configured by device-configurator (true)
    *  or by user via HAL API (false) */
    bool                                dc_configured;
    bool                                clock_owned;
} _cyhal_sdxx_t;

#endif /* defined(CY_IP_MXSDHC) */

/**
  * @brief SDHC object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXSDHC)
    _cyhal_sdxx_t                       sdxx;

    uint8_t                             bus_width;
    bool                                enable_led_control;
    /* TOUT setting of SDHC block */
    uint8_t                             data_timeout_tout;
    bool                                data_timeout_auto_reconfig;
    /* Desired by user data timeout in card clocks */
    uint32_t                            data_timeout_card_clocks_user;
    cyhal_gpio_t                        pin_data[8];
    cyhal_gpio_t                        pin_card_detect;
    cyhal_gpio_t                        pin_card_pwr_en;
    cyhal_gpio_t                        pin_card_mech_write_prot;
    cyhal_gpio_t                        pin_led_ctrl;
    cyhal_gpio_t                        pin_emmc_reset;
    bool                                low_voltage_io_desired;
    uint32_t                            bus_frequency_hz;
    /* Frequency of HF clock, that provided to SDHC block */
    uint32_t                            block_source_freq_hz;
    /** This needs to mirror cyhal_gpio_callback_data_t, which can't be referenced directly. */
    struct cyhal_sdhc_t_gpio_cb
    {
        void*           callback;
        void*           callback_arg;
        void*           next;
        cyhal_gpio_t    pin;
    }                                   card_detect_cb;
    /* card detect GPIO callback enabled */
    bool                                cd_gpio_cb_enabled;
    uint16_t                            emmc_generic_cmd6_time_ms;
#else
    void *empty;
#endif /* defined(CY_IP_MXSDHC) */
} cyhal_sdhc_t;

/**
  * @brief SDHC configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXSDHC)
    const cyhal_resource_inst_t*            resource;
    const cy_stc_sd_host_init_config_t*     host_config;
    cy_stc_sd_host_sd_card_config_t*        card_config;
    cyhal_clock_t*                          clock;
    struct
    {
        cyhal_gpio_t                        clk;
        cyhal_gpio_t                        cmd;
        cyhal_gpio_t                        data[8];
        cyhal_gpio_t                        card_detect;
        cyhal_gpio_t                        io_volt_sel;
        cyhal_gpio_t                        card_pwr_en;
        cyhal_gpio_t                        card_mech_write_prot;
        cyhal_gpio_t                        led_ctrl;
        cyhal_gpio_t                        emmc_reset;
    } gpios;
#else
    void *empty;
#endif /* defined(CY_IP_MXSDHC) */
} cyhal_sdhc_configurator_t;

/**
  * @brief SDIO object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXSDHC)
    _cyhal_sdxx_t                       sdxx;
    /* whether the block is configured by device-configurator (true)
    *  or by user via HAL API (false) */
    bool                                dc_configured;
    bool                                clock_owned;
#elif defined(CYHAL_UDB_SDIO)
    cyhal_dma_t                         dma0Ch0;
    cyhal_dma_t                         dma0Ch1;
    cyhal_dma_t                         dma1Ch1;
    cyhal_dma_t                         dma1Ch3;
    stc_sdio_irq_cb_t*                  pfuCb;

