RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include_pvt/cyhal_hw_types.h
    cyhal_clock_t                       clock;
    cyhal_resource_inst_t               resource;
    cyhal_gpio_t                        pin_clk;
    cyhal_gpio_t                        pin_cmd;

    uint32_t                            irq_cause;

    bool                                pm_transition_pending;
    cyhal_syspm_callback_data_t         pm_callback_data;
#endif /* defined(CYHAL_IP_MXSDHC) */

#if defined(CY_IP_MXSDHC) || defined(CYHAL_UDB_SDIO)
    cyhal_gpio_t                        pin_data0;
    cyhal_gpio_t                        pin_data1;
    cyhal_gpio_t                        pin_data2;
    cyhal_gpio_t                        pin_data3;

    uint32_t                            frequencyhal_hz;
    uint16_t                            block_size;

    uint32_t                            events;
#else
    void *empty;
#endif /* defined(CY_IP_MXSDHC) || defined(CYHAL_UDB_SDIO) */
} cyhal_sdio_t;

/**
  * @brief SDIO configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXSDHC)
    const cyhal_resource_inst_t*            resource;
    const cy_stc_sd_host_init_config_t*     host_config;
    cy_stc_sd_host_sd_card_config_t*        card_config;
    cyhal_clock_t*                          clock;
    struct
    {
        cyhal_gpio_t                        clk;
        cyhal_gpio_t                        cmd;
        cyhal_gpio_t                        data[4];
    } gpios;
#else
    void *empty;
#endif /* defined(CY_IP_MXSDHC) */
} cyhal_sdio_configurator_t;

/**
  * @brief SPI object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXSCB)
    CySCB_Type*                         base;
    cyhal_resource_inst_t               resource;
    cyhal_gpio_t                        pin_miso;
    cyhal_gpio_t                        pin_mosi;
    cyhal_gpio_t                        pin_sclk;
    cyhal_gpio_t                        pin_ssel[4];
    cy_en_scb_spi_polarity_t            ssel_pol[4];
    uint8_t                             active_ssel;
    cyhal_clock_t                       clock;
    cy_en_scb_spi_sclk_mode_t           clk_mode;
    uint8_t                             mode;
    uint8_t                             data_bits;
    bool                                is_slave;
    bool                                alloc_clock;
    uint8_t                             oversample_value;
    bool                                msb_first;
    cy_stc_scb_spi_context_t            context;
    uint32_t                            irq_cause;
    uint16_t volatile                   pending;
    uint8_t                             write_fill;
    void                                *rx_buffer;
    uint32_t                            rx_buffer_size;
    const void                          *tx_buffer;
    uint32_t                            tx_buffer_size;
    bool                                is_async;
    cyhal_event_callback_data_t         callback_data;
    bool                                dc_configured;
#else
    void *empty;
#endif
} cyhal_spi_t;

/**
  * @brief SPI configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct {
#if defined(CY_IP_MXSCB)
    const cyhal_resource_inst_t*            resource;
    const cy_stc_scb_spi_config_t*          config;
    const cyhal_clock_t*                    clock;
    struct
    {
        cyhal_gpio_t                        sclk;
        cyhal_gpio_t                        ssel[4];
        cyhal_gpio_t                        mosi;
        cyhal_gpio_t                        miso;
    } gpios;
#else
    void *empty;
#endif /* defined(CY_IP_MXSCB) */
} cyhal_spi_configurator_t;

/**
  * @brief TDM object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef _cyhal_audioss_t cyhal_tdm_t;

/**
  * @brief TDM configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef _cyhal_audioss_configurator_t cyhal_tdm_configurator_t;

/**
  * @brief Timer object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXTCPWM
    cyhal_tcpwm_t                       tcpwm;
    uint32_t                            default_value;
#else
    void *empty;
#endif
} cyhal_timer_t;

/**
  * @brief Timer configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct
{
#if CYHAL_DRIVER_AVAILABLE_TIMER
    const cyhal_resource_inst_t*            resource;
    const cy_stc_tcpwm_counter_config_t*    config;
    const cyhal_clock_t *                   clock;
#else
    void *empty;
#endif /* CYHAL_DRIVER_AVAILABLE_TIMER */
} cyhal_timer_configurator_t;

/**
  * @brief UART object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXSCB
    CySCB_Type*                         base;
    cyhal_resource_inst_t               resource;
    cyhal_gpio_t                        pin_rx;
    cyhal_gpio_t                        pin_tx;
    cyhal_gpio_t                        pin_cts;
    cyhal_gpio_t                        pin_rts;
    bool                                cts_enabled;
    bool                                rts_enabled;
    bool                                is_clock_owned;
    cyhal_clock_t                       clock;
    cy_stc_scb_uart_context_t           context;
    cy_stc_scb_uart_config_t            config;
    uint32_t                            irq_cause;
    en_hsiom_sel_t                      saved_tx_hsiom;
    en_hsiom_sel_t                      saved_rts_hsiom;
    cyhal_event_callback_data_t         callback_data;
    bool                                dc_configured;
#else
    void *empty;
#endif
} cyhal_uart_t;

/**
  * @brief UART configurator struct
  *
  * This struct allows a configurator to provide block configuration information
  * to the HAL. Because configurator-generated configurations are platform
  * specific, the contents of this struct is subject to change between platforms
  * and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXSCB
    const cyhal_resource_inst_t*            resource;
    const cy_stc_scb_uart_config_t*         config;
    const cyhal_clock_t*                    clock;
    struct
    {
        cyhal_gpio_t                        pin_tx;
        cyhal_gpio_t                        pin_rts;
        cyhal_gpio_t                        pin_cts;
    } gpios;
#else
    void *empty;
#endif /* CY_IP_MXSCB */
} cyhal_uart_configurator_t;

/**
  * @brief USB Device object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
#ifdef CY_IP_MXUSBFS
    USBFS_Type*                         base;
    cy_stc_usbfs_dev_drv_context_t      context;
    cyhal_resource_inst_t               resource;
    cyhal_resource_inst_t               pll_resource;
    cyhal_clock_t                       clock;
    bool                                shared_clock;
    cyhal_gpio_t                        pin_dp;
    cyhal_gpio_t                        pin_dm;
    cyhal_syspm_callback_data_t         pm_callback;
    uint8_t *rd_data[CY_USBFS_DEV_DRV_NUM_EPS_MAX];
    uint32_t rd_size[CY_USBFS_DEV_DRV_NUM_EPS_MAX];
#else
    void *empty;
#endif
} cyhal_usb_dev_t;

/**
  * @brief WDT object
  *
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct {
    uint8_t placeholder;
} cyhal_wdt_t;

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/** \} group_hal_impl_hw_types */
/** \} group_hal_impl */
